app/controllers/comments_controller.rb

  def create
    # logger.info("=========> COMMENTS / create #{params[:comment]}")
    @comment = @fortune.comments.build(params[:comment])
    @comment.save
---
INSERT INTO "comments" ("author", "body", "created_at", "fortune_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "cdav"], ["body", "f"], ["created_at", Mon, 03 Dec 2012 13:51:00 UTC +00:00], ["fortune_id", 9], ["updated_at", Mon, 03 Dec 2012 13:51:00 UTC +00:00]]

  def destroy
    # logger.info("=========> COMMENTS / destroy #{params[:id]}")
    @comment = @fortune.comments.find(params[:id])
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."fortune_id" = 5 AND "comments"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]