app/controllers/fortunes_controller.rb

  def index
    @fortunes = Fortune.search(params[:search]).order(:author).page(params[:page]).per(2)
---
SELECT "fortunes".* FROM "fortunes" WHERE (body LIKE '%być%') ORDER BY author LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "fortunes" WHERE (body LIKE '%być%')

  def tags
    # logger.info("=========> TAGS #{params[:name]}")
    @fortunes = Fortune.tagged_with(params[:name]).order(:author).page(params[:page]).per(4)
---
SELECT "fortunes".* FROM "fortunes" JOIN taggings fortunes_taggings_lotnisko_516 ON fortunes_taggings_lotnisko_516.taggable_id = fortunes.id AND fortunes_taggings_lotnisko_516.taggable_type = 'Fortune' AND fortunes_taggings_lotnisko_516.tag_id = 5 ORDER BY author LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "fortunes" JOIN taggings fortunes_taggings_lotnisko_516 ON fortunes_taggings_lotnisko_516.taggable_id = fortunes.id AND fortunes_taggings_lotnisko_516.taggable_type = 'Fortune' AND fortunes_taggings_lotnisko_516.tag_id = 5

  def show
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = 1 LIMIT 1

  def edit
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = 9 LIMIT 1

  def create
    @fortune = Fortune.new(params[:fortune])
    @fortune.save
---
INSERT INTO "fortunes" ("author", "body", "created_at", "updated_at") VALUES ('dvdfg', 'vfdv', '2012-10-22 07:10:56.641919', '2012-10-22 07:10:56.641919')

  def update
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "9"]]

  def destroy
    @fortune = Fortune.find(params[:id])
    @fortune.destroy
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = 1 LIMIT 1
DELETE FROM "fortunes" WHERE "fortunes"."id" = 1