app/controllers/sessions_controller.rb

def create
  auth = request.env["omniauth.auth"]
  user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES ('twitter', '914440736', 'Piotr Kotłowski', '2012-10-30 11:39:21.566943', '2012-10-30 11:39:21.566943')
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '914440736' LIMIT 1